wschang0/trusted-firmware-m-m2354/platform/ext/target/nuvoton/common/cmsis_drivers/Driver_OTP.c
/*
 * Copyright (c) 2013-2018 ARM Limited. All rights reserved.
 * Copyright (c) 2022 Nuvoton Technology Corp. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include "Driver_Flash.h"
#include "NuMicro.h"
#include "RTE_Device.h"
#include "flash_layout.h"
#include "region_defs.h"

#ifndef ARG_UNUSED
#define ARG_UNUSED(arg)  ((void)arg)
#endif

/* Driver version */
#define ARM_FLASH_DRV_VERSION    ARM_DRIVER_VERSION_MAJOR_MINOR(1, 0)

/*
 * ARM FLASH device structure
 */
struct arm_flash_dev_t
{
    const uint32_t memory_base;   /*!< FLASH memory base address */
    ARM_FLASH_INFO *data;         /*!< FLASH data */
};

/* Flash Status */
static ARM_FLASH_STATUS FlashStatus = {0, 0, 0};

/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion =
{
    ARM_FLASH_API_VERSION,
    ARM_FLASH_DRV_VERSION
};

/* Driver Capabilities */
static const ARM_FLASH_CAPABILITIES DriverCapabilities =
{
    0, /* event_ready */
    2, /* data_width = 0:8-bit, 1:16-bit, 2:32-bit */
    1  /* erase_chip */
};

static int32_t is_range_valid(struct arm_flash_dev_t *flash_dev,
                              uint32_t offset)
{
    uint32_t otp_limit = 0;
    int32_t rc = 0;

    otp_limit = (flash_dev->data->sector_count * flash_dev->data->sector_size) - 1;

    if(offset > otp_limit)
    {
        rc = -1;
    }
    return rc;
}

static int32_t is_write_aligned(struct arm_flash_dev_t *flash_dev,
                                uint32_t param)
{
    int32_t rc = 0;

    if((param % flash_dev->data->program_unit) != 0)
    {
        rc = -1;
    }
    return rc;
}

static int32_t is_sector_aligned(struct arm_flash_dev_t *flash_dev,
                                 uint32_t offset)
{
    int32_t rc = 0;

    if((offset % flash_dev->data->sector_size) != 0)
    {
        rc = -1;
    }
    return rc;
}

#if (RTE_FLASH0)
static ARM_FLASH_INFO ARM_OTP0_DEV_DATA =
{
    .sector_info  = NULL,                  /* Uniform sector layout */
    .sector_count = 1,
    .sector_size  = 3096,
    .page_size    = 3096,
    .program_unit = 4,
    .erased_value = 0xFF
};

static struct arm_flash_dev_t ARM_OTP0_DEV =
{
    .memory_base = FMC_OTP_BASE,
    .data        = &(ARM_OTP0_DEV_DATA)
};

struct arm_flash_dev_t *OTP0_DEV = &ARM_OTP0_DEV;

/*
 * Functions
 */

static ARM_DRIVER_VERSION ARM_OTP_GetVersion(void)
{
    return DriverVersion;
}

static ARM_FLASH_CAPABILITIES ARM_OTP_GetCapabilities(void)
{
    return DriverCapabilities;
}

static int32_t ARM_OTP_Initialize(ARM_Flash_SignalEvent_t cb_event)
{
    ARG_UNUSED(cb_event);
    /* Nothing to be done */

    FMC_Open();
    FMC_ENABLE_AP_UPDATE();
    FMC_ENABLE_LD_UPDATE();


    return ARM_DRIVER_OK;
}

static int32_t ARM_OTP_Uninitialize(void)
{
    /* Nothing to be done */
    return ARM_DRIVER_OK;
}

static int32_t ARM_OTP_PowerControl(ARM_POWER_STATE state)
{
    switch(state)
    {
        case ARM_POWER_FULL:
            /* Nothing to be done */
            return ARM_DRIVER_OK;
            break;

        case ARM_POWER_OFF:
        case ARM_POWER_LOW:
        default:
            return ARM_DRIVER_ERROR_UNSUPPORTED;
    }
}

static int32_t ARM_OTP_ReadData(uint32_t addr, void *data, uint32_t cnt)
{
    uint32_t start_addr = OTP0_DEV->memory_base + addr;
    int32_t rc = 0;
    uint32_t i;
    uint32_t u32Data;
    uint8_t* dest, *src;

    /* Check flash memory boundaries */
    rc = is_range_valid(OTP0_DEV, addr + cnt);
    if (rc != 0) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    /* Start address is not word alignment*/
    if(start_addr & 0x3)
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    dest = (uint8_t*)data;
    src = (uint8_t*)&u32Data;
    while(cnt > 4)
    {
        u32Data = FMC_Read(start_addr);
        for(i = 0; i < 4; i++)
        {
            *dest++ = src[i];
        }
        cnt -= 4;
        start_addr += 4;
    }

    if(cnt > 0)
    {
        u32Data = FMC_Read(start_addr);
        for(i = 0; i < cnt; i++)
        {
            *dest++ = src[i];
        }
    }
    return ARM_DRIVER_OK;
}

static int32_t ARM_OTP_ProgramData(uint32_t addr, const void *data, uint32_t cnt)
{
    volatile uint32_t mem_base = OTP0_DEV->memory_base;
    uint32_t start_addr = mem_base + addr;
    int32_t rc = 0;
    int32_t i,j;

    /* Check flash memory boundaries and alignment with minimal write size */
    rc  = is_range_valid(OTP0_DEV, addr + cnt);
    rc |= is_write_aligned(OTP0_DEV, addr);
    rc |= is_write_aligned(OTP0_DEV, cnt);
    if(rc != 0)
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    {
        uint8_t *pu8;
        uint32_t u32Data;

        pu8 = (uint8_t *)data; // Note the data buffer address may not be word alignment

        u32Data = 0;
        j = 0;
        for(i=0;i<cnt;i++)
        {
            u32Data += (uint32_t)pu8[i] << (8*j);
            j++;

            if(j>=4)
            {
                FMC_Write(start_addr+(i+1-4), u32Data);
                j = 0;
                u32Data = 0;
            }
        }

        if(j)
        {
            // This should not happen.
            while(1);
        }

    }

    return ARM_DRIVER_OK;
}

static int32_t ARM_OTP_EraseSector(uint32_t addr)
{
    volatile uint32_t mem_base = OTP0_DEV->memory_base;
    uint32_t start_addr = mem_base + addr;
    uint32_t rc = 0;

    rc  = is_range_valid(OTP0_DEV, addr);
    rc |= is_sector_aligned(OTP0_DEV, addr);
    if(rc != 0)
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    FMC_Erase(start_addr);

    return ARM_DRIVER_OK;
}

static int32_t ARM_OTP_EraseChip(void)
{
    uint32_t i;
    uint32_t addr = OTP0_DEV->memory_base;
    int32_t rc = ARM_DRIVER_ERROR_UNSUPPORTED;

    /* Check driver capability erase_chip bit */
    if(DriverCapabilities.erase_chip == 1)
    {
        for(i = 0; i < OTP0_DEV->data->sector_count; i++)
        {
            FMC_Erase(addr);
            addr += OTP0_DEV->data->sector_size;
            rc = ARM_DRIVER_OK;
        }
    }
    return rc;
}

static ARM_FLASH_STATUS ARM_OTP_GetStatus(void)
{
    return FlashStatus;
}

static ARM_FLASH_INFO * ARM_OTP_GetInfo(void)
{
    return OTP0_DEV->data;
}

ARM_DRIVER_FLASH Driver_OTP0 =
{
    ARM_OTP_GetVersion,
    ARM_OTP_GetCapabilities,
    ARM_OTP_Initialize,
    ARM_OTP_Uninitialize,
    ARM_OTP_PowerControl,
    ARM_OTP_ReadData,
    ARM_OTP_ProgramData,
    ARM_OTP_EraseSector,
    ARM_OTP_EraseChip,
    ARM_OTP_GetStatus,
    ARM_OTP_GetInfo
};
#endif /* RTE_FLASH0 */
